Revit 2027 API
ScheduleDefinition.IsValidFieldId Method
 Checks whether a ScheduleFieldId is the ID of a field in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFieldId(
	ScheduleFieldId fieldId
)
Public Function IsValidFieldId (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool IsValidFieldId(
	ScheduleFieldId^ fieldId
)
member IsValidFieldId :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The field ID to check.
Return Value
Boolean
 True if the field ID is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace